In [1]:
#1-1복습누적 덧셈기능을 하는 함수를 정의하고
#이를 사용하여 2,3,7,11을 덧셈한 결과를 화면에 출력하라
r1 = 0
def add1(num):
    global r1
    r1 += num
    return r1
print(add1(2))
print(add1(3))
print(add1(7))
print(add1(11))

2
5
12
23

In [4]:
#1-2복습 누적 덧셈기능을 하는 클래스를 정의하고
#누적 덧셈기 1은 21부터 3,4의 배수 4개을 덧셈한 결과를 화면에 출력하라
#누적 덧셈기 2는 2,3,7,11을 덧셈한 결과를 화면에 출력하라
class Calculator():
    def __init__(self):
        self.result =0

    def add(self, num):
        self.result += num
        return self.result

cal1=Calculator()
cal2=Calculator()

print(cal1.add(21))
print(cal1.add(24))
print(cal1.add(27))
print("누적 덧셈기 1:",cal1.add(28))

print(cal2.add(2))
print(cal2.add(3))
print(cal2.add(7))
print("누적 덧셈기 2:",cal2.add(11))

21
45
72
누적 덧셈기 1: 100
2
5
12
누적 덧셈기 2: 23

In [5]:
#실습 판다스 1. Series : 1월~4월 평균 온도 생성
#예 1월~4월 평균온도(-20, -10, 10, 20)
import pandas as pd
temp=pd.Series([-20, -10, 10, 20])
print(temp)

0   -20
1   -10
2    10
3    20
dtype: int64

In [21]:
temp[1] #2월 평균기온

-10

In [14]:
import pandas as pd
temp2 = pd.Series([-15, -5, 5, 15], index=['Jan', 'Feb', 'Mar', 'Apr'])
print(temp)

Jan   -20
Feb   -10
Mar    10
Apr    20
dtype: int64

In [25]:
#사원번호 4자리(인덱스)와 이름을 시리즈로 5개의 데이터를 생성하라
import pandas as pd
temp3 = pd.Series(['박정배', '조민준', '최수희', '정재민', '박범근'], index=[1111, 2222, 3333, 4444, 5555])
print(temp3)

1111    박정배
2222    조민준
3333    최수희
4444    정재민
5555    박범근
dtype: object

In [26]:
#2 데이터 프레임 만들기
#2-1 리스트 사용
import pandas as pd

list1=list([['Han_nit', 'Man', '20', '180'],
            ['Han_la', 'Man', '21', '177'],
            ['Han_na', 'Woman', '20', '160']
           ])
col_names=['name', 'Sex', 'age', 'height']
pd.DataFrame(list1, columns=col_names)

      name    Sex age height
0  Han_nit    Man  20    180
1   Han_la    Man  21    177
2   Han_na  Woman  20    160

In [27]:
# 딕셔너리 사용
import pandas as pd
dict1={'name':{0:'Han_bit', 1:'Han_la', 2:'Han_na'},
       'Set':{0:'Man', 1:'Man', 2:'Woman'},
       'age':{0:'20', 1:'21', 2:'20'},
       'height':{0:'180', 1:'177', 2:'160'}
      }
pd.DataFrame(dict1)

      name    Set age height
0  Han_bit    Man  20    180
1   Han_la    Man  21    177
2   Han_na  Woman  20    160

In [28]:
# 넘파이 배열로 DF생성
import numpy as np
import pandas as pd

arr1=np.array([['Han_nit', 'Man', '20', '180'],
            ['Han_la', 'Man', '21', '177'],
            ['Han_na', 'Woman', '20', '160']
           ])
col_names=['name', 'Sex', 'age', 'height'] #배열이기 때문에 col_names을 사용
pd.DataFrame(arr1, columns=col_names)

      name    Sex age height
0  Han_nit    Man  20    180
1   Han_la    Man  21    177
2   Han_na  Woman  20    160

In [29]:
#4 CSV파일로 DF 생성
import pandas as pd

list1=list([['Han_bit', 'Man', '20', '180'],
            ['Han_la', 'Man', '21', '177'],
            ['Han_na', 'Woman', '20', '160']
           ])
col_names=['name', 'Sex', 'age', 'height']
df=pd.DataFrame(list1, columns=col_names)
df

      name    Sex age height
0  Han_bit    Man  20    180
1   Han_la    Man  21    177
2   Han_na  Woman  20    160

In [31]:
#CSV파일로 저장
df.to_csv('./file.csv', header=True, index=False, encoding='utf-8')
#CSV파일 읽기
df2=pd.read_csv('./file.csv', sep=',')
df2

      name    Sex  age  height
0  Han_bit    Man   20     180
1   Han_la    Man   21     177
2   Han_na  Woman   20     160

In [37]:
df2.columns

Index(['name', 'Sex', 'age', 'height'], dtype='object')

In [40]:
df2.describe()

             age      height
count   3.000000    3.000000
mean   20.333333  172.333333
std     0.577350   10.785793
min    20.000000  160.000000
25%    20.000000  168.500000
50%    20.000000  177.000000
75%    20.500000  178.500000
max    21.000000  180.000000

In [38]:
df2.head(2)

      name  Sex  age  height
0  Han_bit  Man   20     180
1   Han_la  Man   21     177

In [39]:
df2.tail(2)

     name    Sex  age  height
1  Han_la    Man   21     177
2  Han_na  Woman   20     160

In [33]:
#실습 복습
#2-1 시리즈생성 -1~6월 평균온도가 -15, -4, 5, 13, 20, 25 인 경우 (월 정보를 인덱스로 사용하세요)
import pandas as pd
temp4 = pd.Series([-15, -4, 5, 13, 20, 25], index=['1월', '2월', '3월', '4월', '5월', '6월'])
print(temp4)

1월   -15
2월    -4
3월     5
4월    13
5월    20
6월    25
dtype: int64

In [34]:
#2-2 데이터 프레임 생성 방법 3가지로 데이터프레임을 만드세요
#과목번호, 과목명,  수강시간, 담당교수  (본인 시간표 이용) 
#리스트 사용
import pandas as pd

list4=list([['0966201', '파이썬응용', '화234', '정은화'],
            ['0367203', 'C++프로그래밍', '월789', '곽노윤'],
            ['0218605', '자료구조론', '수67', '이성훈']
           ])
col_names=['과목번호', '과목명', '수강시간', '담당교수']
pd.DataFrame(list4, columns=col_names)

      과목번호       과목명  수강시간 담당교수
0  0966201     파이썬응용  화234  정은화
1  0367203  C++프로그래밍  월789  곽노윤
2  0218605     자료구조론   수67  이성훈

In [36]:
#넘파이 배열 사용
import numpy as np
import pandas as pd

arr2=np.array([['0966201', '파이썬응용', '화234', '정은화'],
            ['0367203', 'C++프로그래밍', '월789', '곽노윤'],
            ['0218605', '자료구조론', '수67', '이성훈']
           ])
col_names=['과목번호', '과목명', '수강시간', '담당교수']
pd.DataFrame(arr2, columns=col_names)

      과목번호       과목명  수강시간 담당교수
0  0966201     파이썬응용  화234  정은화
1  0367203  C++프로그래밍  월789  곽노윤
2  0218605     자료구조론   수67  이성훈

In [41]:
#딕셔너리 사용
import pandas as pd
dict2={'과목번호':{0:'0966201', 1:'0367203', 2:'0218605'},
       '과목명':{0:'파이썬응용', 1:'프로그래밍', 2:'자료구조론'},
       '수강시간':{0:'화234', 1:'월789', 2:'수67'},
       '담당교수':{0:'정은화', 1:'곽노윤', 2:'이성훈'}
      }
pd.DataFrame(dict2)

      과목번호    과목명  수강시간 담당교수
0  0966201  파이썬응용  화234  정은화
1  0367203  프로그래밍  월789  곽노윤
2  0218605  자료구조론   수67  이성훈

In [44]:
#2-3  위 3개의 데이터 프레임을 time1.csv, time2.csv, time3.csv만들고
#이를 불러와서 조회하는 방법을 실습하기(오늘 배운 내용)
import pandas as pd

list5=list([['0966201', '파이썬응용', '화234', '정은화'],
            ['0367203', 'C++프로그래밍', '월789', '곽노윤'],
            ['0218605', '자료구조론', '수67', '이성훈']
           ])
col_names=['과목번호', '과목명', '수강시간', '담당교수']
df3=pd.DataFrame(list5, columns=col_names)
df3

      과목번호       과목명  수강시간 담당교수
0  0966201     파이썬응용  화234  정은화
1  0367203  C++프로그래밍  월789  곽노윤
2  0218605     자료구조론   수67  이성훈

In [45]:
#CSV파일로 저장
df3.to_csv('./file2.csv', header=True, index=False, encoding='utf-8')
#CSV파일 읽기
df4=pd.read_csv('./file2.csv', sep=',')
df4

     과목번호       과목명  수강시간 담당교수
0  966201     파이썬응용  화234  정은화
1  367203  C++프로그래밍  월789  곽노윤
2  218605     자료구조론   수67  이성훈